MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX210F016C.PIC
      <edc:DCRDef edc:_addr="0x1FC00BFC" edc:access="---n---n--------nnnnnn-----nnnnn" edc:cname="DEVCFG0" edc:default="0x7fffffff" edc:desc="" edc:factorydefault="0x7fffffff" edc:impl="0x1100fc1f" edc:name="DEVCFG0" edc:nzwidth="0x20" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x1100FC1F">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Enable" edc:isidehidden="true" edc:mask="0x3" edc:name="DEBUG" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Debugger is Enabled" edc:when="(field &amp; 0x2) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Debugger is Disabled" edc:when="(field &amp; 0x2) == 0x2"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Enable" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="JTAG Port Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="JTAG Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ICESEL" edc:desc="ICE/ICD Comm Channel Select" edc:mask="0x3" edc:name="ICESEL" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ICS_PGx1" edc:desc="Communicate on PGEC1/PGED1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx2" edc:desc="Communicate on PGEC2/PGED2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx3" edc:desc="Communicate on PGEC3/PGED3" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="PWP" edc:desc="Program Flash Write Protect" edc:mask="0x3f" edc:name="PWP" edc:nzwidth="6">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disable" edc:when="(field &amp; 0x3f) == 0x3f"/>
              <edc:DCRFieldSemantic edc:cname="PWP1K" edc:desc="First 1K" edc:when="(field &amp; 0x3f) == 0x3e"/>
              <edc:DCRFieldSemantic edc:cname="PWP2K" edc:desc="First 2K" edc:when="(field &amp; 0x3f) == 0x3d"/>
              <edc:DCRFieldSemantic edc:cname="PWP3K" edc:desc="First 3K" edc:when="(field &amp; 0x3f) == 0x3c"/>
              <edc:DCRFieldSemantic edc:cname="PWP4K" edc:desc="First 4K" edc:when="(field &amp; 0x3f) == 0x3b"/>
              <edc:DCRFieldSemantic edc:cname="PWP5K" edc:desc="First 5K" edc:when="(field &amp; 0x3f) == 0x3a"/>
              <edc:DCRFieldSemantic edc:cname="PWP6K" edc:desc="First 6K" edc:when="(field &amp; 0x3f) == 0x39"/>
              <edc:DCRFieldSemantic edc:cname="PWP7K" edc:desc="First 7K" edc:when="(field &amp; 0x3f) == 0x38"/>
              <edc:DCRFieldSemantic edc:cname="PWP8K" edc:desc="First 8K" edc:when="(field &amp; 0x3f) == 0x37"/>
              <edc:DCRFieldSemantic edc:cname="PWP9K" edc:desc="First 9K" edc:when="(field &amp; 0x3f) == 0x36"/>
              <edc:DCRFieldSemantic edc:cname="PWP10K" edc:desc="First 10K" edc:when="(field &amp; 0x3f) == 0x35"/>
              <edc:DCRFieldSemantic edc:cname="PWP11K" edc:desc="First 11K" edc:when="(field &amp; 0x3f) == 0x34"/>
              <edc:DCRFieldSemantic edc:cname="PWP12K" edc:desc="First 12K" edc:when="(field &amp; 0x3f) == 0x33"/>
              <edc:DCRFieldSemantic edc:cname="PWP13K" edc:desc="First 13K" edc:when="(field &amp; 0x3f) == 0x32"/>
              <edc:DCRFieldSemantic edc:cname="PWP14K" edc:desc="First 14K" edc:when="(field &amp; 0x3f) == 0x31"/>
              <edc:DCRFieldSemantic edc:cname="PWP15K" edc:desc="First 15K" edc:when="(field &amp; 0x3f) == 0x30"/>
              <edc:DCRFieldSemantic edc:cname="PWP16K" edc:desc="First 16K" edc:when="(field &amp; 0x3f) == 0x2f"/>
              <edc:DCRFieldSemantic edc:cname="PWP17K" edc:desc="First 17K" edc:when="(field &amp; 0x3f) == 0x2e"/>
              <edc:DCRFieldSemantic edc:cname="PWP18K" edc:desc="First 18K" edc:when="(field &amp; 0x3f) == 0x2d"/>
              <edc:DCRFieldSemantic edc:cname="PWP19K" edc:desc="First 19K" edc:when="(field &amp; 0x3f) == 0x2c"/>
              <edc:DCRFieldSemantic edc:cname="PWP20K" edc:desc="First 20K" edc:when="(field &amp; 0x3f) == 0x2b"/>
              <edc:DCRFieldSemantic edc:cname="PWP21K" edc:desc="First 21K" edc:when="(field &amp; 0x3f) == 0x2a"/>
              <edc:DCRFieldSemantic edc:cname="PWP22K" edc:desc="First 22K" edc:when="(field &amp; 0x3f) == 0x29"/>
              <edc:DCRFieldSemantic edc:cname="PWP23K" edc:desc="First 23K" edc:when="(field &amp; 0x3f) == 0x28"/>
              <edc:DCRFieldSemantic edc:cname="PWP24K" edc:desc="First 24K" edc:when="(field &amp; 0x3f) == 0x27"/>
              <edc:DCRFieldSemantic edc:cname="PWP25K" edc:desc="First 25K" edc:when="(field &amp; 0x3f) == 0x26"/>
              <edc:DCRFieldSemantic edc:cname="PWP26K" edc:desc="First 26K" edc:when="(field &amp; 0x3f) == 0x25"/>
              <edc:DCRFieldSemantic edc:cname="PWP27K" edc:desc="First 27K" edc:when="(field &amp; 0x3f) == 0x24"/>
              <edc:DCRFieldSemantic edc:cname="PWP28K" edc:desc="First 28K" edc:when="(field &amp; 0x3f) == 0x23"/>
              <edc:DCRFieldSemantic edc:cname="PWP29K" edc:desc="First 29K" edc:when="(field &amp; 0x3f) == 0x22"/>
              <edc:DCRFieldSemantic edc:cname="PWP30K" edc:desc="First 30K" edc:when="(field &amp; 0x3f) == 0x21"/>
              <edc:DCRFieldSemantic edc:cname="PWP31K" edc:desc="First 31K" edc:when="(field &amp; 0x3f) == 0x20"/>
              <edc:DCRFieldSemantic edc:cname="PWP32K" edc:desc="First 32K" edc:when="(field &amp; 0x3f) == 0x1f"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="BWP" edc:desc="Boot Flash Write Protect bit" edc:mask="0x1" edc:name="BWP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protect" edc:mask="0x1" edc:name="CP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x1d000000" edc:checksumalgo="0x80" edc:endaddr="0x1d07ffff"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x20" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="Sign" edc:ishidden="true" edc:mask="0x1" edc:name="RESERVED" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:desc="Reserved always 0" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:GPRDataSector edc:beginaddr="0x0" edc:endaddr="0x1000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:kuseg="0x7f000000" edc:regionid="kseg1_data_mem"/>
    <edc:SFRDataSector edc:beginaddr="0x1f800000" edc:endaddr="0x1f80a400" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph0">
      <edc:SFRDef edc:_addr="0x1F800000" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01385_wdt_pwrt_pb_v2.Module" edc:_refcount="1" edc:access="----------------n--------rrrrrnn" edc:cname="WDTCON" edc:desc="" edc:grp="WDT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x--------xxxxxxx" edc:name="WDTCON" edc:nzwidth="0x20" edc:por="----------------0--------00000x0" edc:portals="CLR SET INV" ltx:baseofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDTCLR" edc:desc="" edc:mask="0x1" edc:name="WDTCLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTWINEN" edc:desc="" edc:mask="0x1" edc:name="WDTWINEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS" edc:desc="" edc:mask="0x1f" edc:name="SWDTPS" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SWDTPS0" edc:desc="" edc:mask="0x1" edc:name="SWDTPS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS1" edc:desc="" edc:mask="0x1" edc:name="SWDTPS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS2" edc:desc="" edc:mask="0x1" edc:name="SWDTPS2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS3" edc:desc="" edc:mask="0x1" edc:name="SWDTPS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS4" edc:desc="" edc:mask="0x1" edc:name="SWDTPS4" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WDTPSTA" edc:desc="" edc:mask="0x1" edc:name="WDTPSTA" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WDTPS" edc:desc="" edc:mask="0x1" edc:name="WDTPS" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.3">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
